Revit 2027 API
BeamSystemJustifyType Enumeration
Describes the justify method of beamsystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BeamSystemJustifyType
Public Enumeration BeamSystemJustifyType
public enum class BeamSystemJustifyType
type BeamSystemJustifyType
Members
Member name | Value | Description
Beginning | 3 | Beginning.
Center | 1 | Center.
DirectionLine | 4 | DirectionLine.
End | 2 | End.
See Also
Reference
Autodesk.Revit.DB Namespace